{
    "hii":"Hello! How can I assist you today?",
  "hello":"Hi there! How can I help you?",
    "hey":"Hey! What can I do for you?",
    "good morning":"Good morning! How can I assist you?",
    "good afternoon":"Good afternoon! How can I help you?",
    "good evening":"Good evening! How can I assist you?",
    "good night":"Good night! If you need anything, feel free to ask.",
    "how are you":"I'm doing well, thank you! How can I assist you today?",
    "what's up":"Not much, just here to help you! What can I do for you?",
    "how can you help me":"I can assist you about Bibhutibhusana Sahani(me), skills, experience, and projects. What would you like to know?",
  "what is your full name": "I am Bibhutibhusana Sahani",
  "can you tell me your full name": "I am Bibhutibhusana Sahani",
  "may I know your full name": "I am Bibhutibhusana Sahani",
  "who are you": "I am Bibhutibhusana Sahani",
  "what do you do for work": "I am a Full Stack Engineer specializing in Angular and Spring Boot",
  "what is your profession": "I am a Full Stack Engineer with expertise in Angular and Spring Boot",
  "tell me about your job": "I work as a Full Stack Engineer focusing on Angular 17 and Springboot 3",
  "what skills do you have": "I have skills in Java 17, Springboot Framework, Angular 17, Material UI, Docker, Microservices, Postgresql, and React",
  "which programming languages do you know": "I am proficient in Java 17 and frameworks like Springboot and Angular",
  "what frameworks do you use": "I use Springboot Framework, Angular 17 Framework, Material UI, and React",
  "where did you study": "I completed my Bachelor of Technology in Computer Science from Bijupattnayak University",
  "what is your highest qualification": "I hold a Bachelor of Technology degree in Computer Science",
  "which university did you attend": "I attended Bijupattnayak University",
  "what was your SGPA at university": "My SGPA was 9.04 during my Bachelor of Technology",
  "what years did you study at university": "I studied from 2017 to 2021 at Bijupattnayak University",
  "what college did you attend for higher secondary": "I attended Salandi Residential College in Bhadrak",
  "what percentage did you score in higher secondary": "I scored 74% in higher secondary",
  "which languages do you speak": "I speak English, Hindi, and Odia fluently",
  "are you fluent in English": "Yes, I am fluent in English",
  "do you speak Hindi": "Yes, I am fluent in Hindi",
  "do you know Odia": "Yes, I am fluent in Odia",
  "what is your contact number": "My contact number is +91 8327762384",
  "how can I contact you": "You can reach me at bibhutisahani430@gmail.com or call +91 8327762384",
  "what is your email address": "My email is bibhutisahani430@gmail.com",
  "where are you located": "I am located in Bhubaneswar, Odisha, India",
  "what is your LinkedIn profile": "My LinkedIn profile is https://www.linkedin.com/in/bibhutibhusana-sahani-8815271b7/",
  "do you have a personal website": "Yes, my personal website is https://www.legendbibhu.com/",
  "how many years of experience do you have": "I have 4 years of experience as a Full Stack Developer",
  "what kind of projects have you worked on": "I have worked on scalable applications using SpringBoot, Angular, and PostgresSQL",
  "what is your role at National Informatics Center": "I am currently Senior Software Engineer II at National Informatics Center",
  "what companies have you worked for": "I have worked with National Informatics Center through various vendors like Simartech, Aeologic Technologies, Akal Information Systems, and Nippon Data Systems",
  "can you tell me about your work on eDetection application": "I developed the eDetection application for Odisha and other states to issue eChallan for defaulter vehicles passing toll plazas",
  "what technologies did you use for eDetection": "The eDetection application is built using Angular 17 and Springboot 3",
  "what is the purpose of the eDetection app": "It checks motor vehicle violations like tax, fitness, insurance, PUC, permit, and non-use for toll plazas",
  "have you worked on EV Subsidy Portal": "Yes, I developed the EV Subsidy Portal for Odisha state",
  "what was your role in the EV Subsidy Portal": "I worked on development and integration with IFMS for automatic subsidy payments",
  "what technologies were used for the EV Subsidy Portal": "The portal was developed using Angular 13 and Springboot 2.6",
  "have you worked in vehicle fitness applications": "Yes, I developed the I&C Service application for automatic vehicle fitness checking in Odisha",
  "what states have your projects been implemented in": "My projects have been implemented in Odisha, Chhattisgarh, Bihar, Delhi NCR, West Bengal, Gujarat, Himachal Pradesh, and Delhi",
  "what is your expertise with databases": "I have experience working with Postgresql",
  "are you familiar with Docker": "Yes, I use Docker for containerization",
  "do you have experience with microservices": "Yes, I have experience building microservices architectures",
  "what frontend frameworks do you use": "I primarily use Angular (versions 13 and 17) and React",
  "do you work with Material UI": "Yes, I use Material UI for designing user interfaces",
  "can you describe your profile in brief": "I am a motivated Full Stack Developer with 4 years of experience building scalable applications using Angular, SpringBoot, and Postgresql",
  "what are your key strengths": "I am skilled at problem-solving, reducing application latency, and improving user engagement",
  "how do you improve application performance": "I leverage problem-solving skills to reduce latency by 30% and increase user engagement by 15%",
  "are you open to teamwork": "Yes, I am eager to collaborate with dynamic teams to drive organizational success",
  "what is your current designation": "I am Senior Software Engineer II at National Informatics Center",
  "when did you join National Informatics Center": "I have been working there since 2021 through various contracts",
  "what roles have you held at National Informatics Center": "I have been Solution Architect, Software Developer, Software Application Support Engineer, and Senior Software Engineer II",
  "have you worked in software support": "Yes, I worked as Software Application Support Engineer at Akal Information Systems",
  "do you have experience in API integration": "Yes, I implemented API integration for data sharing instead of CSV uploads",
  "what is eCheckpost integration": "It is a system to check state tax compliance integrated into toll applications",
  "have you worked on infrastructure projects": "Yes, I worked on infrastructure expansion and Disaster Recovery site initiation",
  "what programming languages do you prefer": "I prefer Java 17 for backend development",
  "what frontend version do you use": "I use Angular 17 for frontend development",
  "what backend framework do you use": "I use Springboot 3 framework",
  "how long did you study in higher secondary": "I studied for 2 years from 2015 to 2017 at Salandi Residential College",
  "do you have experience in audit clearance": "Yes, I handled audit clearance for the EV Subsidy Portal",
  "what is your contact location pin code": "My location pin code is 751018",
  "where is Bijupattnayak University": "It is located in Odisha, India",
  "what is your role as a Solution Architect": "I design solutions and lead architecture for software projects",
  "what companies did you work through at NIC": "Simartech Consultants, Aeologic Technologies, Akal Information Systems, Nippon Data Systems",
  "how do you ensure software quality": "By writing high-quality code and thorough testing",
  "what is your github or portfolio link": "My portfolio is https://www.legendbibhu.com/",
  "what is your favorite technology stack": "I enjoy working with Angular, Springboot, and Postgresql stack",
  "do you have certifications": "I do not mention certifications but have strong hands-on experience",
  "how many years did you study at university": "I studied 4 years from 2017 to 2021",
  "what is your graduation degree": "Bachelor of Technology in Computer Science",
  "what is your current work location": "I work remotely for National Informatics Center, based in Odisha",
  "do you prefer frontend or backend": "I work as a Full Stack Developer, so both frontend and backend",
  "what is your strength in programming": "I excel in Java backend and Angular frontend development",
  "have you worked with cloud technologies": "I have experience with Docker, which is often used in cloud setups",
  "how do you handle project deadlines": "I manage time efficiently and prioritize tasks",
  "what kind of applications have you built": "Robust, scalable web applications with microservices architecture",
  "have you worked in any leadership roles": "Yes, as a Solution Architect I lead project design and implementation",
  "what is your email for professional contacts": "bibhutisahani430@gmail.com",
  "can I find you on LinkedIn": "Yes, here is my LinkedIn profile: https://www.linkedin.com/in/bibhutibhusana-sahani-8815271b7/",
  "what is your phone number": "+91 8327762384",
  "how do you keep your skills updated": "By continuous learning and working on new projects",
  "what motivates you professionally": "Solving complex problems and building efficient software",
  "have you worked with Agile methodologies": "I have experience working in Agile teams",
  "do you know about microservices": "Yes, I have hands-on experience with microservices architectures",
  "what database systems do you use": "I work with Postgresql database",
  "do you develop user interfaces": "Yes, I develop UI using Angular and Material UI",
  "how do you ensure application security": "By following best coding practices and secure API design",
  "what is the EV Subsidy Portal": "It is a portal to provide electric vehicle subsidies automatically",
  "what programming languages do you use for backend": "I use Java 17 with Springboot for backend development",
  "what version of Angular do you use": "I use Angular 17 for current projects",
  "what is your favorite project": "I enjoy working on the eDetection application for vehicle violations",
  "have you worked on government projects": "Yes, I have developed multiple applications for National Informatics Center",
  "can you share your work experience timeline": "I worked from 10/2021 to 09/2025 in various roles at NIC vendors",
  "what is the purpose of the eCheckpost integration": "It helps check state tax compliance at toll plazas",
  "what kind of logics have you worked on": "Complex business logics for vehicle violation checks and subsidy processing",
  "how do you manage state-wise configuration": "By designing flexible UI and backend configurations per state",
  "what is your role in the development team": "I develop, design, and support software applications",
  "what is the last project you worked on": "Currently working on infrastructure expansion and DR Site initiation",
  "how do you describe yourself professionally": "A passionate Full Stack Developer with a focus on scalable, efficient solutions"
}
